app/views/user/show.html.erb


  <% @user.answers(:include => 'questions', :order => 'questions.ui_order').each do |answer| %>
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`user_id` = 9