app/controllers/books_controller.rb

  def create
    books = Book.where(:id => params[:book][:id])
    if books.empty?
      redirect_to '/add_please'
    else
      book = books[0]
      book.vote_count = book.vote_count + 1
      book.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1
SELECT COUNT(*) FROM "books" WHERE "books"."id" = 1
UPDATE "books" SET "vote_count" = 1, "updated_at" = '2012-01-17 22:44:01.459363' WHERE "books"."id" = 1

  def thank_you
    @books = Book.all(:order => 'vote_count desc', :limit => 50)
---
SELECT "books".* FROM "books" ORDER BY vote_count desc LIMIT 50