app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    begin
      @user = User.find params[:id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
---
  def edit
    # user is only allowed to edit his own page
    @user = User.find params[:id]

SELECT `answers`.* FROM `answers` WHERE `answers`.`user_id` = 11
DELETE FROM `answers` WHERE `answers`.`id` = 77
UPDATE `answers` SET `answerText` = 'Hello1', `updated_at` = '2012-01-15 10:58:30' WHERE `answers`.`id` = 58
---
  def update
    params.select {|k| k.to_s.start_with? 'q'}.each do |k, v|
      answer = current_user.answers.find {|a| a.question_id.to_s == k.to_s.gsub('q', '')}
      if answer.nil?
        create_answer v, k.to_s.gsub('q', '') unless v.empty?
      else
        if v.empty?
          answer.destroy
        else
          answer.answerText = v
          answer.save

UPDATE `users` SET `successful` = 0, `updated_at` = '2012-01-15 10:11:34' WHERE `users`.`id` = 10
---
  def create
    current_user.successful = params[:a] == 'Y'
    params.select {|k| k.to_s.start_with? 'q'}.each do |k, v|
      create_answer v, k.to_s.gsub('q', '') unless v.nil? or v.empty?
    end
    current_user.save